deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
/*
*********************************************************************************************************
*
*	模块名称 : 串口中断+FIFO驱动模块
*	文件名称 : bsp_uart_fifo.c
*	版    本 : V1.8
*	说    明 : 采用串口中断+FIFO模式实现多个串口的同时访问
*	修改记录 :
*		版本号  日期       作者    说明
*
*	Copyright (C), 2015-2030,www.autobma.com
*
*********************************************************************************************************
*/

#include "bsp.h"


/* 定义每个串口结构体变量 */
#if UART1_FIFO_EN == 1
    static UART_T g_tUart1;
    static uint8_t g_TxBuf1[UART1_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf1[UART1_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART2_FIFO_EN == 1
    static UART_T g_tUart2;
    static uint8_t g_TxBuf2[UART2_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf2[UART2_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART3_FIFO_EN == 1
    static UART_T g_tUart3;
    static uint8_t g_TxBuf3[UART3_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf3[UART3_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART4_FIFO_EN == 1
    static UART_T g_tUart4;
    static uint8_t g_TxBuf4[UART4_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf4[UART4_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART5_FIFO_EN == 1
    static UART_T g_tUart5;
    static uint8_t g_TxBuf5[UART5_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf5[UART5_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART6_FIFO_EN == 1
    static UART_T g_tUart6;
    static uint8_t g_TxBuf6[UART6_TX_BUF_SIZE];		/* 发送缓冲区 */
    static uint8_t g_RxBuf6[UART6_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

UART_HandleTypeDef IPC_huart1;// IPCOM
UART_HandleTypeDef CH2_huart2;// CHANNEL 2
UART_HandleTypeDef CH3_huart3;// CHANNEL 3
UART_HandleTypeDef CH4_huart4;// CHANNEL 4
UART_HandleTypeDef CH5_huart5;// CHANNEL 5
UART_HandleTypeDef CH1_huart6;// CHANNEL 1

/* --- UART4 DMA TX (CH4) --- */
#define UART4_TX_DMA_BUF (600u)
static uint8_t  g_u4txbuf[UART4_TX_DMA_BUF];
static volatile uint8_t g_u4txbusy = 0u;
/* --- UART6 DMA TX (CH2) --- */
#define UART6_TX_DMA_BUF (600u)
static uint8_t  g_u6txbuf[UART6_TX_DMA_BUF];
static volatile uint8_t g_u6txbusy = 0u;

static void UartVarInit(void);
static void InitHardUart(void);
static void UartSend(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen);
static void uart6_dma_tx_start(const uint8_t *src, uint16_t len);
static void uart4_dma_tx_start(const uint8_t *src, uint16_t len);
static uint8_t UartGetChar(UART_T *_pUart, uint8_t *_pByte);
static void UartIRQ(UART_T *_pUart);


static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART4_UART_Init(void);
static void MX_USART5_UART_Init(void);
static void MX_USART6_UART_Init(void);
/*
*********************************************************************************************************
*	函 数 名: bsp_InitUart
*	功能说明: 初始化串口硬件，并对全局变量赋初值.
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitUart(void)
{

    UartVarInit();		/* 必须先初始化全局变量,再配置硬件 */

    InitHardUart();		/* 配置串口的硬件参数(波特率等) */

}

/*
*********************************************************************************************************
*	函 数 名: ComToUart
*	功能说明: 将COM端口号转换为UART指针
*	形    参: _ucPort: 端口号(COM1 - COM8)
*	返 回 值: uart指针
*********************************************************************************************************
*/
UART_T *ComToUart(COM_PORT_E _ucPort)
{
    if (_ucPort == COM1)
    {
        #if UART1_FIFO_EN == 1
        return &g_tUart1;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM2)
    {
        #if UART2_FIFO_EN == 1
        return &g_tUart2;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM3)
    {
        #if UART3_FIFO_EN == 1
        return &g_tUart3;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM4)
    {
        #if UART4_FIFO_EN == 1
        return &g_tUart4;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM5)
    {
        #if UART5_FIFO_EN == 1
        return &g_tUart5;
        #else
        return 0;
        #endif
    }
    else if (_ucPort == COM6)
    {
        #if UART6_FIFO_EN == 1
        return &g_tUart6;
        #else
        return 0;
        #endif
    }
    else
    {
        Error_Handler();
        return 0;
    }
}

/*
*********************************************************************************************************
*	函 数 名: comSendBuf
*	功能说明: 向串口发送一组数据。数据放到发送缓冲区后立即返回，由中断服务程序在后台完成发送
*	形    参: _ucPort: 端口号(COM1 - COM8)
*			  _ucaBuf: 待发送的数据缓冲区
*			  _usLen : 数据长度
*	返 回 值: 无
*********************************************************************************************************
*/
void comSendBuf(COM_PORT_E _ucPort, uint8_t *_ucaBuf, uint16_t _usLen)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);

    if (pUart == 0)
    {
        return;
    }

#if UART4_FIFO_EN == 1
    if (pUart->uart == USART4)
    {
        uart4_dma_tx_start(_ucaBuf, _usLen);
        return;
    }
#endif
#if UART6_FIFO_EN == 1
    if (pUart->uart == USART6)
    {
        uart6_dma_tx_start(_ucaBuf, _usLen);
        return;
    }
#endif
    /* TX via FIFO + TXE interrupt for other uarts */

//	if (pUart->SendBefor != 0)
//	{
//		pUart->SendBefor();		/* 如果是RS485通信，可以在这个函数中将RS485设置为发送模式 */
//	}

    UartSend(pUart, _ucaBuf, _usLen);
}

/*
*********************************************************************************************************
*	函 数 名: comGetChar
*	功能说明: 从接收缓冲区读取1字节，非阻塞。无论有无数据均立即返回。
*	形    参: _ucPort: 端口号(COM1 - COM8)
*			  _pByte: 接收到的数据存放在这个地址
*	返 回 值: 0 表示无数据, 1 表示读取到有效字节
*********************************************************************************************************
*/
uint8_t comGetChar(COM_PORT_E _ucPort, uint8_t *_pByte)
{
    UART_T *pUart;

