deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
    pUart = ComToUart(_ucPort);

    if (pUart == 0)
    {
        return 0;
    }

    return UartGetChar(pUart, _pByte);
}

/*
*********************************************************************************************************
*	函 数 名: UartVarInit
*	功能说明: 初始化串口相关的变量
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void UartVarInit(void)
{
    #if UART1_FIFO_EN == 1
    g_tUart1.uart = USART1;						/* STM32 串口设备 */
    g_tUart1.pTxBuf = g_TxBuf1;					/* 发送缓冲区指针 */
    g_tUart1.pRxBuf = g_RxBuf1;					/* 接收缓冲区指针 */
    g_tUart1.usTxBufSize = UART1_TX_BUF_SIZE;	/* 发送缓冲区大小 */
    g_tUart1.usRxBufSize = UART1_RX_BUF_SIZE;	/* 接收缓冲区大小 */
    g_tUart1.usTxWrite = 0;						/* 发送FIFO写索引 */
    g_tUart1.usTxRead = 0;						/* 发送FIFO读索引 */
    g_tUart1.usRxWrite = 0;						/* 接收FIFO写索引 */
    g_tUart1.usRxRead = 0;						/* 接收FIFO读索引 */
    g_tUart1.usRxCount = 0;						/* 接收到的新数据个数 */
    g_tUart1.usTxCount = 0;						/* 待发送的数据个数 */
    g_tUart1.SendBefor = 0;						/* 发送数据前的回调函数 */
    g_tUart1.SendOver = 0;						/* 发送完毕后的回调函数 */
    g_tUart1.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
    g_tUart1.Sending = 0;						/* 正在发送中标志 */
    g_tUart1.uartirq = USART1_IRQn;
    #endif

    #if UART2_FIFO_EN == 1
    g_tUart2.uart = USART2;						/* STM32 串口设备 */
    g_tUart2.pTxBuf = g_TxBuf2;					/* 发送缓冲区指针 */
    g_tUart2.pRxBuf = g_RxBuf2;					/* 接收缓冲区指针 */
    g_tUart2.usTxBufSize = UART2_TX_BUF_SIZE;	/* 发送缓冲区大小 */
    g_tUart2.usRxBufSize = UART2_RX_BUF_SIZE;	/* 接收缓冲区大小 */
    g_tUart2.usTxWrite = 0;						/* 发送FIFO写索引 */
    g_tUart2.usTxRead = 0;						/* 发送FIFO读索引 */
    g_tUart2.usRxWrite = 0;						/* 接收FIFO写索引 */
    g_tUart2.usRxRead = 0;						/* 接收FIFO读索引 */
    g_tUart2.usRxCount = 0;						/* 接收到的新数据个数 */
    g_tUart2.usTxCount = 0;						/* 待发送的数据个数 */
    g_tUart2.SendBefor = 0;						/* 发送数据前的回调函数 */
    g_tUart2.SendOver = 0;						/* 发送完毕后的回调函数 */
    g_tUart2.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
    g_tUart2.Sending = 0;						/* 正在发送中标志 */
    g_tUart2.uartirq = USART2_IRQn;
    #endif

    #if UART3_FIFO_EN == 1
    g_tUart3.uart = USART3;						/* STM32 串口设备 */
    g_tUart3.pTxBuf = g_TxBuf3;					/* 发送缓冲区指针 */
    g_tUart3.pRxBuf = g_RxBuf3;					/* 接收缓冲区指针 */
    g_tUart3.usTxBufSize = UART3_TX_BUF_SIZE;	/* 发送缓冲区大小 */
    g_tUart3.usRxBufSize = UART3_RX_BUF_SIZE;	/* 接收缓冲区大小 */
    g_tUart3.usTxWrite = 0;						/* 发送FIFO写索引 */
    g_tUart3.usTxRead = 0;						/* 发送FIFO读索引 */
    g_tUart3.usRxWrite = 0;						/* 接收FIFO写索引 */
    g_tUart3.usRxRead = 0;						/* 接收FIFO读索引 */
    g_tUart3.usRxCount = 0;						/* 接收到的新数据个数 */
    g_tUart3.usTxCount = 0;						/* 待发送的数据个数 */
    g_tUart3.SendBefor = 0;		/* 发送数据前的回调函数 */
    g_tUart3.SendOver  = 0;			/* 发送完毕后的回调函数 */
    g_tUart3.ReciveNew = 0;		/* 接收到新数据后的回调函数 */
    g_tUart3.Sending = 0;						/* 正在发送中标志 */
    g_tUart3.uartirq = USART3_6_IRQn;
    #endif

    #if UART4_FIFO_EN == 1
    g_tUart4.uart = USART4;						/* STM32 串口设备 */
    g_tUart4.pTxBuf = g_TxBuf4;					/* 发送缓冲区指针 */
    g_tUart4.pRxBuf = g_RxBuf4;					/* 接收缓冲区指针 */
    g_tUart4.usTxBufSize = UART4_TX_BUF_SIZE;	/* 发送缓冲区大小 */
    g_tUart4.usRxBufSize = UART4_RX_BUF_SIZE;	/* 接收缓冲区大小 */
    g_tUart4.usTxWrite = 0;						/* 发送FIFO写索引 */
    g_tUart4.usTxRead = 0;						/* 发送FIFO读索引 */
    g_tUart4.usRxWrite = 0;						/* 接收FIFO写索引 */
    g_tUart4.usRxRead = 0;						/* 接收FIFO读索引 */
    g_tUart4.usRxCount = 0;						/* 接收到的新数据个数 */
    g_tUart4.usTxCount = 0;						/* 待发送的数据个数 */
    g_tUart4.SendBefor = 0;						/* 发送数据前的回调函数 */
    g_tUart4.SendOver  = 0;						/* 发送完毕后的回调函数 */
    g_tUart4.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
    g_tUart4.Sending = 0;						/* 正在发送中标志 */
    g_tUart4.uartirq = USART3_6_IRQn;
    #endif

    #if UART5_FIFO_EN == 1
    g_tUart5.uart = USART5;						/* STM32 串口设备 */
    g_tUart5.pTxBuf = g_TxBuf5;					/* 发送缓冲区指针 */
    g_tUart5.pRxBuf = g_RxBuf5;					/* 接收缓冲区指针 */
    g_tUart5.usTxBufSize = UART5_TX_BUF_SIZE;	/* 发送缓冲区大小 */
    g_tUart5.usRxBufSize = UART5_RX_BUF_SIZE;	/* 接收缓冲区大小 */
    g_tUart5.usTxWrite = 0;						/* 发送FIFO写索引 */
    g_tUart5.usTxRead = 0;						/* 发送FIFO读索引 */
    g_tUart5.usRxWrite = 0;						/* 接收FIFO写索引 */
    g_tUart5.usRxRead = 0;						/* 接收FIFO读索引 */
    g_tUart5.usRxCount = 0;						/* 接收到的新数据个数 */
    g_tUart5.usTxCount = 0;						/* 待发送的数据个数 */
    g_tUart5.SendBefor = 0;						/* 发送数据前的回调函数 */
    g_tUart5.SendOver = 0;						/* 发送完毕后的回调函数 */
    g_tUart5.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
    g_tUart5.Sending = 0;						  /* 正在发送中标志 */
    g_tUart5.uartirq = USART3_6_IRQn;
    #endif


    #if UART6_FIFO_EN == 1
    g_tUart6.uart = USART6;						/* STM32 串口设备 */
    g_tUart6.pTxBuf = g_TxBuf6;					/* 发送缓冲区指针 */
    g_tUart6.pRxBuf = g_RxBuf6;					/* 接收缓冲区指针 */
    g_tUart6.usTxBufSize = UART6_TX_BUF_SIZE;	/* 发送缓冲区大小 */
    g_tUart6.usRxBufSize = UART6_RX_BUF_SIZE;	/* 接收缓冲区大小 */
    g_tUart6.usTxWrite = 0;						/* 发送FIFO写索引 */
    g_tUart6.usTxRead = 0;						/* 发送FIFO读索引 */
    g_tUart6.usRxWrite = 0;						/* 接收FIFO写索引 */
    g_tUart6.usRxRead = 0;						/* 接收FIFO读索引 */
    g_tUart6.usRxCount = 0;						/* 接收到的新数据个数 */
    g_tUart6.usTxCount = 0;						/* 待发送的数据个数 */
    g_tUart6.SendBefor = 0;						/* 发送数据前的回调函数 */
    g_tUart6.SendOver = 0;						/* 发送完毕后的回调函数 */
    g_tUart6.ReciveNew = 0;						/* 接收到新数据后的回调函数 */
    g_tUart6.Sending = 0;						/* 正在发送中标志 */
    g_tUart6.uartirq = USART3_6_IRQn;
    #endif


}

/*
*********************************************************************************************************
*	函 数 名: InitHardUart
*	功能说明: 配置串口的硬件参数（波特率，数据位，停止位，起始位，校验位，中断使能）适合于STM32-H7开发板
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void InitHardUart(void)
{
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_USART3_UART_Init();
    MX_USART4_UART_Init();
    MX_USART5_UART_Init();
    MX_USART6_UART_Init();
#if UART6_FIFO_EN == 1
    __HAL_RCC_DMA1_CLK_ENABLE();
    HAL_NVIC_SetPriority(DMA1_Channel2_3_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel2_3_IRQn);
#endif
#if UART4_FIFO_EN == 1
    __HAL_RCC_DMA1_CLK_ENABLE();
    HAL_NVIC_SetPriority(DMA1_Channel4_5_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel4_5_IRQn);
#endif
}

