deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
/*
*********************************************************************************************************
*	函 数 名: UartSend
*	功能说明: 填写数据到UART发送缓冲区,并启动发送中断。中断处理函数发送完毕后，自动关闭发送中断
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void UartSend(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen)
{
    uint16_t i;

    for (i = 0; i < _usLen; i++)
    {
        /* 如果发送缓冲区已经满了，则等待缓冲区空 */
        while (1)
        {
            __IO uint16_t usCount;

            HAL_NVIC_DisableIRQ(_pUart->uartirq);
            usCount = _pUart->usTxCount;
            HAL_NVIC_EnableIRQ(_pUart->uartirq);

            if (usCount < _pUart->usTxBufSize)
            {
                break;
            }
            else if(usCount == _pUart->usTxBufSize)/* 数据已填满缓冲区 */
            {
                if((_pUart->uart->CR1 & USART_CR1_TXEIE) == 0)
                {
                    SET_BIT(_pUart->uart->CR1, USART_CR1_TXEIE);
                }
            }
        }

        /* 将新数据填入发送缓冲区 */
        _pUart->pTxBuf[_pUart->usTxWrite] = _ucaBuf[i];

        //DISABLE_INT();
        HAL_NVIC_DisableIRQ(_pUart->uartirq);

        if (++_pUart->usTxWrite >= _pUart->usTxBufSize)
        {
            _pUart->usTxWrite = 0;
        }

        _pUart->usTxCount++;
        //ENABLE_INT();
        HAL_NVIC_EnableIRQ(_pUart->uartirq);
    }

    SET_BIT(_pUart->uart->CR1, USART_CR1_TXEIE);	/* 使能发送中断（缓冲区空） */
}

/* UART6 DMA TX via CH2: disable TXE/TC IRQ first so ISR does not race DMA */
static void uart6_dma_tx_start(const uint8_t *src, uint16_t len)
{
    uint16_t i;
    if (g_u6txbusy != 0u) { return; }
    if (len > UART6_TX_DMA_BUF) { return; }
    for (i = 0u; i < len; i++) { g_u6txbuf[i] = src[i]; }
    /* stop interrupt-driven TX on USART6 so DMA owns TDR */
    CLEAR_BIT(USART6->CR1, USART_CR1_TXEIE);
    CLEAR_BIT(USART6->CR1, USART_CR1_TCIE);
    DMA1_Channel2->CCR = 0u;
    DMA1_Channel2->CMAR = (uint32_t)g_u6txbuf;
    DMA1_Channel2->CPAR = (uint32_t)&USART6->TDR;
    DMA1_Channel2->CNDTR = len;
    DMA1->CSELR = (DMA1->CSELR & ~DMA1_CSELR_CH2_USART6_TX_Msk) | DMA1_CSELR_CH2_USART6_TX;
    DMA1_Channel2->CCR = DMA_CCR_DIR | DMA_CCR_MINC | DMA_CCR_TCIE | DMA_CCR_EN;
    SET_BIT(USART6->CR3, USART_CR3_DMAT);
    g_u6txbusy = 1u;
}

/* DMA1 CH2 TX complete (UART6) */
void DMA1_Channel2_3_IRQHandler(void)
{
    if ((DMA1->ISR & DMA_ISR_TCIF2) != 0u)
    {
        DMA1->IFCR = DMA_IFCR_CTCIF2;
        CLEAR_BIT(USART6->CR3, USART_CR3_DMAT);
        SET_BIT(USART6->ICR, USART_ICR_TCCF);
        g_u6txbusy = 0u;
    }
#if UART3_FIFO_EN == 1 && UART3_DMA_RX == 1
    if ((DMA1->ISR & DMA_ISR_TCIF3) != 0u)
    {
        DMA1->IFCR = DMA_IFCR_CTCIF3;   /* U3 RX DMA circular TC */
    }
#endif
}

/* UART4 DMA TX via CH4 */
static void uart4_dma_tx_start(const uint8_t *src, uint16_t len)
{
    uint16_t i;
    if (g_u4txbusy != 0u) { return; }
    if (len > UART4_TX_DMA_BUF) { return; }
    for (i = 0u; i < len; i++) { g_u4txbuf[i] = src[i]; }
    CLEAR_BIT(USART4->CR1, USART_CR1_TXEIE);
    CLEAR_BIT(USART4->CR1, USART_CR1_TCIE);
    DMA1_Channel4->CCR = 0u;
    DMA1_Channel4->CMAR = (uint32_t)g_u4txbuf;
    DMA1_Channel4->CPAR = (uint32_t)&USART4->TDR;
    DMA1_Channel4->CNDTR = len;
    DMA1->CSELR = (DMA1->CSELR & ~DMA1_CSELR_CH4_USART4_TX_Msk) | DMA1_CSELR_CH4_USART4_TX;
    DMA1_Channel4->CCR = DMA_CCR_DIR | DMA_CCR_MINC | DMA_CCR_TCIE | DMA_CCR_EN;
    SET_BIT(USART4->CR3, USART_CR3_DMAT);
    g_u4txbusy = 1u;
}

void DMA1_Channel4_5_IRQHandler(void)
{
    if ((DMA1->ISR & DMA_ISR_TCIF4) != 0u)
    {
        DMA1->IFCR = DMA_IFCR_CTCIF4;
        CLEAR_BIT(USART4->CR3, USART_CR3_DMAT);
        SET_BIT(USART4->ICR, USART_ICR_TCCF);
        g_u4txbusy = 0u;
    }
#if UART5_FIFO_EN == 1 && UART5_DMA_RX == 1
    if ((DMA1->ISR & DMA_ISR_TCIF5) != 0u)
    {
        DMA1->IFCR = DMA_IFCR_CTCIF5;   /* U5 RX DMA circular TC */
    }
#endif
}

/*
*********************************************************************************************************
*	函 数 名: UartGetChar
*	功能说明: 从串口接收缓冲区读取1字节数据 （用于主程序调用）
*	形    参: _pUart : 串口设备
*			  _pByte : 存放读取数据的指针
*	返 回 值: 0 表示无数据  1表示读取到数据
*********************************************************************************************************
*/
static uint8_t UartGetChar(UART_T *_pUart, uint8_t *_pByte)
{
    /* fast path: no critical section when FIFO empty (most polls) */
    if (_pUart->usRxCount == 0)
    {
        return 0;
    }

    /* single critical section: pop one byte and advance the read index */
    HAL_NVIC_DisableIRQ(_pUart->uartirq);
    if (_pUart->usRxCount == 0)   /* re-check inside critical section */
    {
        HAL_NVIC_EnableIRQ(_pUart->uartirq);
        return 0;
    }

    *_pByte = _pUart->pRxBuf[_pUart->usRxRead];
    if (++_pUart->usRxRead >= _pUart->usRxBufSize)
    {
        _pUart->usRxRead = 0;
    }
    _pUart->usRxCount--;
    HAL_NVIC_EnableIRQ(_pUart->uartirq);
    return 1;
}

/*
*********************************************************************************************************
*   函 数 名: UartTxEmpty
*   功能说明: 判断发送缓冲区是否为空。
*   形    参:  _pUart : 串口设备
*   返 回 值: 1为空。0为不空。
*********************************************************************************************************
*/
uint8_t UartTxEmpty(COM_PORT_E _ucPort)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);

    if (pUart == 0)
    {
        return 0;
    }

#if UART4_FIFO_EN == 1
    /* UART4 TX is DMA driven: busy flag AND DMAT bit must both be clear */
    if (pUart->uart == USART4)
    {
        return ((g_u4txbusy == 0u) && ((USART4->CR3 & USART_CR3_DMAT) == 0u)) ? 1u : 0u;
    }
#endif
#if UART6_FIFO_EN == 1
    /* UART6 TX is DMA driven: busy flag AND DMAT bit must both be clear */
    if (pUart->uart == USART6)
    {
        return ((g_u6txbusy == 0u) && ((USART6->CR3 & USART_CR3_DMAT) == 0u)) ? 1u : 0u;
    }
#endif
    /* Interrupt + FIFO TX path: empty only when no queued byte and none in flight */
    if ((pUart->usTxCount != 0u) || (pUart->Sending != 0u))
    {
        return 0;
    }

    return 1;
}

