deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
/*
*********************************************************************************************************
*   函 数 名: UartTxWait
*   功能说明: 等待发送缓冲区空闲，避免上一包尚未发完就重新启动发送导致丢包。
*   形     参:  _ucPort : 串口设备 ; _timeoutMs : 最长等待时间(ms)
*   返 回 值: 1 表示空闲(可发送) ; 0 表示超时仍忙
*********************************************************************************************************
*/
uint8_t UartTxWait(COM_PORT_E _ucPort, uint32_t _timeoutMs)
{
    uint32_t t0 = HAL_GetTick();

    while (UartTxEmpty(_ucPort) == 0u)
    {
        if ((HAL_GetTick() - t0) >= _timeoutMs)
        {
            return 0;
        }
    }

    return 1;
}

/*
*********************************************************************************************************
*	函 数 名: UartIRQ
*	功能说明: 供中断服务程序调用，通用串口中断处理函数
*	形    参: _pUart : 串口设备
*	返 回 值: 无
*********************************************************************************************************
*/
#if (UART3_FIFO_EN == 1 && UART3_DMA_RX == 1) || (UART4_FIFO_EN == 1 && UART4_DMA_RX == 1) || (UART5_FIFO_EN == 1 && UART5_DMA_RX == 1)
/* --- channel UARTs RX via DMA circular + IDLE (experiment) --- */
#define UART_DMA_LEN   (512u)

#if UART3_FIFO_EN == 1 && UART3_DMA_RX == 1
static uint8_t  g_u3dma[UART_DMA_LEN];
static uint16_t g_u3dma_last = 0u;
#endif
#if UART4_FIFO_EN == 1 && UART4_DMA_RX == 1
static uint8_t  g_u4dma[UART_DMA_LEN];
static uint16_t g_u4dma_last = 0u;
#endif
#if UART5_FIFO_EN == 1 && UART5_DMA_RX == 1
static uint8_t  g_u5dma[UART_DMA_LEN];
static uint16_t g_u5dma_last = 0u;
#endif

/* move new bytes from circular DMA buf into the uart RX ring */
static void uart_dma_rx_move(DMA_Channel_TypeDef *ch, uint8_t *dma, uint16_t *last, UART_T *pu)
{
    uint16_t cur;
    uint16_t got;
    uint16_t i;
    uint16_t w;

    cur = (uint16_t)(UART_DMA_LEN - (uint16_t)READ_REG(ch->CNDTR));
    if (cur == *last) { return; }
    if (cur > *last)
    {
        got = (uint16_t)(cur - *last);
        for (i = 0u; i < got; i++)
        {
            w = pu->usRxWrite;
            pu->pRxBuf[w] = dma[(*last + i) & (UART_DMA_LEN - 1u)];
            if (++w >= pu->usRxBufSize) { w = 0u; }
            pu->usRxWrite = w;
            if (pu->usRxCount < pu->usRxBufSize) { pu->usRxCount++; }
        }
    }
    else
    {
        got = (uint16_t)(UART_DMA_LEN - *last);
        for (i = 0u; i < got; i++)
        {
            w = pu->usRxWrite;
            pu->pRxBuf[w] = dma[(*last + i) & (UART_DMA_LEN - 1u)];
            if (++w >= pu->usRxBufSize) { w = 0u; }
            pu->usRxWrite = w;
            if (pu->usRxCount < pu->usRxBufSize) { pu->usRxCount++; }
        }
        got = cur;
        for (i = 0u; i < got; i++)
        {
            w = pu->usRxWrite;
            pu->pRxBuf[w] = dma[i];
            if (++w >= pu->usRxBufSize) { w = 0u; }
            pu->usRxWrite = w;
            if (pu->usRxCount < pu->usRxBufSize) { pu->usRxCount++; }
        }
    }
    *last = cur;
}

/* enable DMA circular RX on one channel uart; called from MX_xxx */
static void uart_dma_rx_cfg(DMA_Channel_TypeDef *ch, uint32_t cselr_msk, uint32_t cselr_val,
                            uint8_t *dma, uint16_t *last, USART_TypeDef *uart)
{
    ch->CCR = 0u;
    ch->CMAR = (uint32_t)dma;
    ch->CPAR = (uint32_t)&uart->RDR;
    ch->CNDTR = UART_DMA_LEN;
    DMA1->CSELR = (DMA1->CSELR & ~cselr_msk) | cselr_val;
    ch->CCR = DMA_CCR_MINC | DMA_CCR_CIRC | DMA_CCR_EN;
    *last = 0u;
    CLEAR_BIT(uart->CR1, USART_CR1_RXNEIE);
    SET_BIT(uart->CR3, USART_CR3_DMAR);
    SET_BIT(uart->CR1, USART_CR1_IDLEIE);
}
#endif
static void UartIRQ_DmaIdle(UART_T *_pUart)
{
    uint32_t isrflags   = READ_REG(_pUart->uart->ISR);
    uint32_t cr1its     = READ_REG(_pUart->uart->CR1);
    uint32_t cr3its     = READ_REG(_pUart->uart->CR3);

#if (UART3_FIFO_EN == 1 && UART3_DMA_RX == 1) || (UART4_FIFO_EN == 1 && UART4_DMA_RX == 1) || (UART5_FIFO_EN == 1 && UART5_DMA_RX == 1)
    /* channel UARTs RX owned by DMA. IDLE marks frame end -> move bytes to ring.
       TXE/TC still handled by common code below (do NOT return). */
#if UART3_FIFO_EN == 1 && UART3_DMA_RX == 1
    if (_pUart->uart == USART3)
    {
        if ((isrflags & USART_ISR_IDLE) != RESET)
        {
            USART3->ICR = USART_ICR_IDLECF;
            uart_dma_rx_move(DMA1_Channel3, g_u3dma, &g_u3dma_last, &g_tUart3);
        }
        isrflags &= ~USART_ISR_RXNE;
    }
#endif
#if UART4_FIFO_EN == 1 && UART4_DMA_RX == 1
    if (_pUart->uart == USART4)
    {
        if ((isrflags & USART_ISR_IDLE) != RESET)
        {
            USART4->ICR = USART_ICR_IDLECF;
            uart_dma_rx_move(DMA1_Channel1, g_u4dma, &g_u4dma_last, &g_tUart4);
        }
        isrflags &= ~USART_ISR_RXNE;
    }
#endif
#if UART5_FIFO_EN == 1 && UART5_DMA_RX == 1
    if (_pUart->uart == USART5)
    {
        if ((isrflags & USART_ISR_IDLE) != RESET)
        {
            USART5->ICR = USART_ICR_IDLECF;
            uart_dma_rx_move(DMA1_Channel5, g_u5dma, &g_u5dma_last, &g_tUart5);
        }
        isrflags &= ~USART_ISR_RXNE;
    }
#endif
#endif
}

static void UartIRQ(UART_T *_pUart)
{
    uint32_t isrflags   = READ_REG(_pUart->uart->ISR);
    uint32_t cr1its     = READ_REG(_pUart->uart->CR1);
    uint32_t cr3its     = READ_REG(_pUart->uart->CR3);

/* 处理接收中断  */
    if ((isrflags & USART_ISR_RXNE) != RESET)
    {
        /* 从串口接收数据寄存器读取数据存放到接收FIFO */
        uint8_t ch;

        ch = READ_REG(_pUart->uart->RDR);
        _pUart->pRxBuf[_pUart->usRxWrite] = ch;

        if (++_pUart->usRxWrite >= _pUart->usRxBufSize)
        {
            _pUart->usRxWrite = 0;
        }

        if (_pUart->usRxCount < _pUart->usRxBufSize)
        {
            _pUart->usRxCount++;
        }

        /* 回调函数,通知应用程序收到新数据,一般是发送1个消息或者设置一个标记 */
        //if (_pUart->usRxWrite == _pUart->usRxRead)
        //if (_pUart->usRxCount == 1)
        {
            if (_pUart->ReciveNew)
            {
                _pUart->ReciveNew(ch); /* 比如，交给MODBUS解码程序处理字节流 */
            }
        }
    }

    /* 处理发送缓冲区空中断 */
    if ( ((isrflags & USART_ISR_TXE) != RESET) && (cr1its & USART_CR1_TXEIE) != RESET)
    {
        //if (_pUart->usTxRead == _pUart->usTxWrite)
        if (_pUart->usTxCount == 0)
        {
            /* 发送缓冲区的数据已取完时， 禁止发送缓冲区空中断 （注意：此时最后1个数据还未真正发送完毕）*/
            //USART_ITConfig(_pUart->uart, USART_IT_TXE, DISABLE);
            CLEAR_BIT(_pUart->uart->CR1, USART_CR1_TXEIE);

            /* 使能数据发送完毕中断 */
            //USART_ITConfig(_pUart->uart, USART_IT_TC, ENABLE);
            SET_BIT(_pUart->uart->CR1, USART_CR1_TCIE);
        }
        else
        {
            _pUart->Sending = 1;

