deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
            /* 从发送FIFO取1个字节写入串口发送数据寄存器 */
            //USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
            _pUart->uart->TDR = _pUart->pTxBuf[_pUart->usTxRead];

            if (++_pUart->usTxRead >= _pUart->usTxBufSize)
            {
                _pUart->usTxRead = 0;
            }

            _pUart->usTxCount--;
        }

    }

    /* 数据bit位全部发送完毕的中断 */
    if (((isrflags & USART_ISR_TC) != RESET) && ((cr1its & USART_CR1_TCIE) != RESET))
    {
        //if (_pUart->usTxRead == _pUart->usTxWrite)
        if (_pUart->usTxCount == 0)
        {
            /* 如果发送FIFO的数据全部发送完毕，禁止数据发送完毕中断 */
            //USART_ITConfig(_pUart->uart, USART_IT_TC, DISABLE);
            CLEAR_BIT(_pUart->uart->CR1, USART_CR1_TCIE);

            /* 回调函数, 一般用来处理RS485通信，将RS485芯片设置为接收模式，避免抢占总线 */
            if (_pUart->SendOver)
            {
                _pUart->SendOver();
            }

            _pUart->Sending = 0;
        }
        else
        {
            /* 正常情况下，不会进入此分支 */

            /* 如果发送FIFO的数据还未完毕，则从发送FIFO取1个数据写入发送数据寄存器 */
            //USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
            _pUart->uart->TDR = _pUart->pTxBuf[_pUart->usTxRead];

            if (++_pUart->usTxRead >= _pUart->usTxBufSize)
            {
                _pUart->usTxRead = 0;
            }

            _pUart->usTxCount--;
        }
    }

    /* clear flags; DMA-RX uarts already cleared IDLE in their branch, skip IDLEF here */
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_PEF);
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_FEF);
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_NEF);
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_OREF);
#if !((UART3_FIFO_EN == 1 && UART3_DMA_RX == 1) || (UART4_FIFO_EN == 1 && UART4_DMA_RX == 1) || (UART5_FIFO_EN == 1 && UART5_DMA_RX == 1))
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_IDLEF);
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_TCF);
#endif
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_CTSF);
    SET_BIT(_pUart->uart->ICR, UART_CLEAR_CMF);

//	*            @arg UART_CLEAR_PEF: Parity Error Clear Flag
//  *            @arg UART_CLEAR_FEF: Framing Error Clear Flag
//  *            @arg UART_CLEAR_NEF: Noise detected Clear Flag
//  *            @arg UART_CLEAR_OREF: OverRun Error Clear Flag
//  *            @arg UART_CLEAR_IDLEF: IDLE line detected Clear Flag
//  *            @arg UART_CLEAR_TCF: Transmission Complete Clear Flag
//  *            @arg UART_CLEAR_LBDF: LIN Break Detection Clear Flag
//  *            @arg UART_CLEAR_CTSF: CTS Interrupt Clear Flag
//  *            @arg UART_CLEAR_RTOF: Receiver Time Out Clear Flag
//  *            @arg UART_CLEAR_CMF: Character Match Clear Flag
//  *            @arg.UART_CLEAR_WUF:  Wake Up from stop mode Clear Flag
//  *            @arg UART_CLEAR_TXFECF: TXFIFO empty Clear Flag
}

/*
*********************************************************************************************************
*	函 数 名: USART1_IRQHandler  USART2_IRQHandler USART3_IRQHandler UART4_IRQHandler UART5_IRQHandler等
*	功能说明: USART中断服务程序
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
#if UART1_FIFO_EN == 1

void USART1_IRQHandler(void)
{
    UartIRQ(&g_tUart1);
}

#endif

#if UART2_FIFO_EN == 1

void USART2_IRQHandler(void)
{
    UartIRQ(&g_tUart2);
}

#endif

#if UART3_FIFO_EN == 1

void USART3_6_IRQHandler(void)
{
    /* service: worst-loss uarts first */
    UartIRQ(&g_tUart6);
#if (UART3_FIFO_EN == 1 && UART3_DMA_RX == 1) || (UART4_FIFO_EN == 1 && UART4_DMA_RX == 1) || (UART5_FIFO_EN == 1 && UART5_DMA_RX == 1)
    UartIRQ_DmaIdle(&g_tUart4);
    UartIRQ(&g_tUart4);
    UartIRQ_DmaIdle(&g_tUart3);
    UartIRQ(&g_tUart3);
    UartIRQ_DmaIdle(&g_tUart5);
    UartIRQ(&g_tUart5);
#endif
}

#endif


static void MX_USART1_UART_Init(void)
{

    /* USER CODE END USART1_Init 1 */
    IPC_huart1.Instance = USART1;
    IPC_huart1.Init.BaudRate = UART1_BAUD;
    IPC_huart1.Init.WordLength = UART_WORDLENGTH_8B;
    IPC_huart1.Init.StopBits = UART_STOPBITS_1;
    IPC_huart1.Init.Parity = UART_PARITY_NONE;
    IPC_huart1.Init.Mode = UART_MODE_TX_RX;
    IPC_huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    IPC_huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    IPC_huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    IPC_huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&IPC_huart1) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART1->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART1->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
    SET_BIT(USART1->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */

}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART2_UART_Init(void)
{

    /* USER CODE END USART2_Init 1 */
    CH2_huart2.Instance = USART2;
    CH2_huart2.Init.BaudRate = UART2_BAUD;
    CH2_huart2.Init.WordLength = UART_WORDLENGTH_8B;
    CH2_huart2.Init.StopBits = UART_STOPBITS_1;
    CH2_huart2.Init.Parity = UART_PARITY_NONE;
    CH2_huart2.Init.Mode = UART_MODE_TX_RX;
    CH2_huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH2_huart2.Init.OverSampling = UART_OVERSAMPLING_16;
    CH2_huart2.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH2_huart2.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&CH2_huart2) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART2->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART2->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
    SET_BIT(USART2->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */
}

/**
  * @brief USART3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART3_UART_Init(void)
{


    CH3_huart3.Instance = USART3;
    CH3_huart3.Init.BaudRate = UART3_BAUD;
    CH3_huart3.Init.WordLength = UART_WORDLENGTH_8B;
    CH3_huart3.Init.StopBits = UART_STOPBITS_1;
    CH3_huart3.Init.Parity = UART_PARITY_NONE;
    CH3_huart3.Init.Mode = UART_MODE_TX_RX;
    CH3_huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH3_huart3.Init.OverSampling = UART_OVERSAMPLING_16;
    CH3_huart3.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH3_huart3.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;


    if (HAL_UART_Init(&CH3_huart3) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART3->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART3->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */

#if UART3_FIFO_EN == 1 && UART3_DMA_RX == 1
    __HAL_RCC_DMA1_CLK_ENABLE();
    uart_dma_rx_cfg(DMA1_Channel3, DMA1_CSELR_CH3_USART3_RX_Msk, DMA1_CSELR_CH3_USART3_RX,
                    g_u3dma, &g_u3dma_last, USART3);
#else
    SET_BIT(USART3->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */
#endif

