deeprfid/alarm_board/STM32F0_linux_v4.31/BSP/bsp_uart_fifo.c
}

/**
  * @brief USART4 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART4_UART_Init(void)
{


    /* USER CODE END USART4_Init 1 */
    CH4_huart4.Instance = USART4;
    CH4_huart4.Init.BaudRate = UART4_BAUD;
    CH4_huart4.Init.WordLength = UART_WORDLENGTH_8B;
    CH4_huart4.Init.StopBits = UART_STOPBITS_1;
    CH4_huart4.Init.Parity = UART_PARITY_NONE;
    CH4_huart4.Init.Mode = UART_MODE_TX_RX;
    CH4_huart4.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH4_huart4.Init.OverSampling = UART_OVERSAMPLING_16;
    CH4_huart4.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH4_huart4.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&CH4_huart4) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART4->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART4->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
#if UART4_FIFO_EN == 1 && UART4_DMA_RX == 1
    __HAL_RCC_DMA1_CLK_ENABLE();
    uart_dma_rx_cfg(DMA1_Channel1, DMA1_CSELR_CH1_USART4_RX_Msk, DMA1_CSELR_CH1_USART4_RX,
                    g_u4dma, &g_u4dma_last, USART4);
#else
    SET_BIT(USART4->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */
#endif

}

/**
  * @brief USART5 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART5_UART_Init(void)
{


    /* USER CODE END USART5_Init 1 */
    CH5_huart5.Instance = USART5;
    CH5_huart5.Init.BaudRate = UART5_BAUD;
    CH5_huart5.Init.WordLength = UART_WORDLENGTH_8B;
    CH5_huart5.Init.StopBits = UART_STOPBITS_1;
    CH5_huart5.Init.Parity = UART_PARITY_NONE;
    CH5_huart5.Init.Mode = UART_MODE_TX_RX;
    CH5_huart5.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH5_huart5.Init.OverSampling = UART_OVERSAMPLING_16;
    CH5_huart5.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH5_huart5.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;


    if (HAL_UART_Init(&CH5_huart5) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART5->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART5->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
#if UART5_FIFO_EN == 1 && UART5_DMA_RX == 1
    __HAL_RCC_DMA1_CLK_ENABLE();
    uart_dma_rx_cfg(DMA1_Channel5, DMA1_CSELR_CH5_USART5_RX_Msk, DMA1_CSELR_CH5_USART5_RX,
                    g_u5dma, &g_u5dma_last, USART5);
#else
    SET_BIT(USART5->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */
#endif

}

/**
  * @brief USART6 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART6_UART_Init(void)
{

    /* USER CODE END USART6_Init 1 */
    CH1_huart6.Instance = USART6;
    CH1_huart6.Init.BaudRate = UART6_BAUD;
    CH1_huart6.Init.WordLength = UART_WORDLENGTH_8B;
    CH1_huart6.Init.StopBits = UART_STOPBITS_1;
    CH1_huart6.Init.Parity = UART_PARITY_NONE;
    CH1_huart6.Init.Mode = UART_MODE_TX_RX;
    CH1_huart6.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    CH1_huart6.Init.OverSampling = UART_OVERSAMPLING_16;
    CH1_huart6.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    CH1_huart6.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&CH1_huart6) != HAL_OK)
    {
        Error_Handler();
    }

    SET_BIT(USART6->ICR, USART_ICR_TCCF);	/* 清除TC发送完成标志 */
    SET_BIT(USART6->RQR, USART_RQR_RXFRQ);/* 清除RXNE接收标志 */
    SET_BIT(USART6->CR1, USART_CR1_RXNEIE);	/* 使能PE. RX接受中断 */

}


/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
